Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/atdf/PIC32CM5164JH01064.atdf
      <value-group name="SUPC_BODVDD__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BODVDD generates a reset" value="0x1"/>
        <value name="INT" caption="The BODVDD generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="WDT__ENABLE">
        <value name="DISABLED" caption="WDT is disabled on power on" value="0x0"/>
        <value name="ENABLED" caption="WDT is enabled on power on" value="0x1"/>
      </value-group>
      <value-group name="WDT__ALWAYSON">
        <value name="DISABLED" caption="WDT is enabled and disabled through ENABLE bit" value="0x0"/>
        <value name="ENABLED" caption="WDT is enabled and can only be disabled by a power-on reset" value="0x1"/>
      </value-group>
      <value-group name="WDT_CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT__WEN">
        <value name="DISABLED" caption="WDT is disabled" value="0x0"/>
        <value name="ENABLED" caption="WDT is enabled" value="0x1"/>
      </value-group>
      <value-group name="SUPC_BODVDD__HYST">
        <value name="DISABLED" caption="No Hysteresis" value="0x0"/>
        <value name="ENABLED" caption="Hysteresis Enabled" value="0x1"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2246" version="2.2.0" caption="32k Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32k Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector" mask="0x4"/>
          <bitfield name="CLKSW" caption="XOSC32K Clock switch" mask="0x8"/>
        </register>
        <register name="RTCCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="RTC Clock Selection">
          <bitfield name="RTCSEL" caption="RTC Clock Selection" mask="0x7" values="OSC32KCTRL_RTCCTRL__RTCSEL"/>
        </register>
