Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH01/atdf/PIC32CM5164JH01064.atdf
        <register modes="USART_EXT" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART_EXT Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_USART_CTRLB__CHSIZE"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40" values="SERCOM_USART_CTRLB__SBMODE"/>
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="ENC" caption="Encoding Format" mask="0x400" values="SERCOM_USART_CTRLB__ENC"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000" values="SERCOM_USART_CTRLB__PMODE"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="LINCMD" caption="LIN Command" mask="0x3000000" values="SERCOM_USART_CTRLB__LINCMD"/>
        </register>
        <register modes="USART_INT" name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="USART_INT Control B">
          <bitfield name="CHSIZE" caption="Character Size" mask="0x7" values="SERCOM_USART_CTRLB__CHSIZE"/>
          <bitfield name="SBMODE" caption="Stop Bit Mode" mask="0x40" values="SERCOM_USART_CTRLB__SBMODE"/>
          <bitfield name="COLDEN" caption="Collision Detection Enable" mask="0x100"/>
          <bitfield name="SFDE" caption="Start of Frame Detection Enable" mask="0x200"/>
          <bitfield name="ENC" caption="Encoding Format" mask="0x400" values="SERCOM_USART_CTRLB__ENC"/>
          <bitfield name="PMODE" caption="Parity Mode" mask="0x2000" values="SERCOM_USART_CTRLB__PMODE"/>
          <bitfield name="TXEN" caption="Transmitter Enable" mask="0x10000"/>
          <bitfield name="RXEN" caption="Receiver Enable" mask="0x20000"/>
          <bitfield name="LINCMD" caption="LIN Command" mask="0x3000000" values="SERCOM_USART_CTRLB__LINCMD"/>
        </register>
        <register modes="USART_EXT" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="USART_EXT Control C">
          <bitfield name="GTIME" caption="Guard Time" mask="0x7"/>
          <bitfield name="BRKLEN" caption="LIN Master Break Length" mask="0x300" values="SERCOM_USART_CTRLC__BRKLEN"/>
          <bitfield name="HDRDLY" caption="LIN Master Header Delay" mask="0xC00" values="SERCOM_USART_CTRLC__HDRDLY"/>
        </register>
        <register modes="USART_INT" name="CTRLC" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="USART_INT Control C">
          <bitfield name="GTIME" caption="Guard Time" mask="0x7"/>
          <bitfield name="BRKLEN" caption="LIN Master Break Length" mask="0x300" values="SERCOM_USART_CTRLC__BRKLEN"/>
          <bitfield name="HDRDLY" caption="LIN Master Header Delay" mask="0xC00" values="SERCOM_USART_CTRLC__HDRDLY"/>
        </register>
        <register modes="I2CM" name="BAUD" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="I2CM Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
          <bitfield name="BAUDLOW" caption="Baud Rate Value Low" mask="0xFF00"/>
          <bitfield name="HSBAUD" caption="High Speed Baud Rate Value" mask="0xFF0000"/>
          <bitfield name="HSBAUDLOW" caption="High Speed Baud Rate Value Low" mask="0xFF000000"/>
        </register>
        <register modes="SPIM" name="BAUD" offset="0xC" rw="RW" size="1" initval="0x00" caption="SPIM Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
        </register>
        <register modes="SPIS" name="BAUD" offset="0xC" rw="RW" size="1" initval="0x00" caption="SPIS Baud Rate">
          <bitfield name="BAUD" caption="Baud Rate Value" mask="0xFF"/>
        </register>
        <register modes="USART_EXT" name="BAUD" offset="0xC" rw="RW" size="2" initval="0x0000" caption="USART_EXT Baud Rate">
          <mode name="DEFAULT" qualifier="SERCOM.USART.CTRLA.FORM" value="0" caption="Default"/>
          <mode name="FRAC" qualifier="SERCOM.USART.CTRLA.FORM" value="4" caption="Fractional Baud mode"/>
          <mode name="FRACFP" qualifier="SERCOM.USART.CTRLA.FORM" value="5" caption="Fractional Baud with Parity mode"/>
          <mode name="USARTFP" qualifier="SERCOM.USART.CTRLA.FORM" value="1" caption="USART Frame with Parity mode"/>
          <bitfield modes="FRAC FRACFP" name="BAUD" caption="Baud Rate Value" mask="0x1FFF"/>
          <bitfield modes="FRAC FRACFP" name="FP" caption="Fractional Part" mask="0xE000"/>
          <bitfield modes="DEFAULT USARTFP" name="BAUD" caption="Baud Rate Value" mask="0xFFFF"/>
        </register>
        <register modes="USART_INT" name="BAUD" offset="0xC" rw="RW" size="2" initval="0x0000" caption="USART_INT Baud Rate">
          <mode name="DEFAULT" qualifier="SERCOM.USART.CTRLA.FORM" value="0" caption="Default"/>
          <mode name="FRAC" qualifier="SERCOM.USART.CTRLA.FORM" value="4" caption="Fractional Baud mode"/>
          <mode name="FRACFP" qualifier="SERCOM.USART.CTRLA.FORM" value="5" caption="Fractional Baud with Parity mode"/>
          <mode name="USARTFP" qualifier="SERCOM.USART.CTRLA.FORM" value="1" caption="USART Frame with Parity mode"/>
          <bitfield modes="FRAC FRACFP" name="BAUD" caption="Baud Rate Value" mask="0x1FFF"/>
          <bitfield modes="FRAC FRACFP" name="FP" caption="Fractional Part" mask="0xE000"/>
          <bitfield modes="DEFAULT USARTFP" name="BAUD" caption="Baud Rate Value" mask="0xFFFF"/>
        </register>
        <register modes="USART_EXT" name="RXPL" offset="0xE" rw="RW" size="1" initval="0x00" caption="USART_EXT Receive Pulse Length">
          <bitfield name="RXPL" caption="Receive Pulse Length" mask="0xFF"/>
        </register>
        <register modes="USART_INT" name="RXPL" offset="0xE" rw="RW" size="1" initval="0x00" caption="USART_INT Receive Pulse Length">
          <bitfield name="RXPL" caption="Receive Pulse Length" mask="0xFF"/>
        </register>
